# Дан список размера N, все элементы которого, кроме первого, упорядочены по
# возрастанию. Сделать список упорядоченным, переместив первый элемент на новую
# позицию.
my_list = [3, 1, 2, 4, 5]
print(my_list)
my_list.sort()
print(my_list)
