anketa_info = [
    (17, 'Алексей', 'Ковалев', '2000-11-11', 'Мужской', '2020-10-09', 'Бухгалтер', 'Отдел бухгалтерии', 80160.3),
    (27, 'Михаил', 'Демьянов', '1999-03-25', 'Мужской', '2021-03-11', 'Web-программист', 'Отдел IT', 147654.6), 
    (33, 'Марина', 'Сафонова', '1991-07-16', 'Женский', '2022-08-23', 'Продавец', 'Отдел продаж', 154876.9),
    (42, 'Юля', 'Быкова', '1998-12-30', 'Женский', '2023-01-14', 'Бухгалтер', 'Отдел бухгалтерии', 80876.7),
    (54, 'Валентин', 'Петров', '2001-05-05', 'Мужской', '2022-08-16', 'Менеджер', 'Отдел менеджмента', 90876.4),
    (67, 'Петр', 'Кузнецов', '1995-02-10', 'Мужской', '2021-05-05', 'Продавец', 'Отдел продаж', 90643.4),
    (71, 'Иван', 'Платонов', '2001-04-07', 'Мужской', '2023-02-07', 'Бухгалтер', 'Отдел бухгалтерии', 167686.1),
    (89, 'Максим', 'Беляев', '2000-08-09', 'Мужской', '2021-04-13', 'Разработчик баз данных', 'Отдел IT', 145876.7),
    (96, 'Анна', 'Цветкова', '2001-10-23', 'Женский', '2020-11-18', 'Менеджер', 'Отдел менеджмента', 167543.4),
    (100, 'Ксения', 'Смирнова', '1970-09-08', 'Женский', '2019-06-26', 'Backend-разработчик', 'Отдел IT', 163765.8)
]